tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "oven-sh/bun"
tap "romkatv/powerlevel10k"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Development kit for the Java programming language
brew "openjdk"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
cask "font-meslo-lg-nerd-font"
# Web browser
cask "google-chrome"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin for JSON files
cask "quicklook-json"
# System monitor for the menu bar
cask "stats"
# Tool for telling interactive, nonlinear stories
cask "twine"
# Rust-based terminal
cask "warp"
mas "1Password for Safari", id: 1569813296
mas "Actions", id: 1586435171
mas "Color Picker", id: 1545870783
mas "Connect my tablet", id: 1352696344
mas "Copy 'Em", id: 876540291
mas "Drafts", id: 1435957248
mas "Hand Mirror", id: 1502839586
mas "Hyperduck", id: 6444667067
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Kindle Classic", id: 405399194
mas "Messenger", id: 1480068668
mas "QuickMIDI", id: 1459790045
mas "Spaced", id: 1666327168
mas "Speedtest", id: 1153157709
mas "TestFlight", id: 899247664
mas "TextSniper", id: 1528890965
mas "Velja", id: 1607635845
# TODO: vscode extensions need sorting out
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "amandeepmittal.console-snippets"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "dnicolson.binary-plist"
vscode "dracula-theme.theme-dracula"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "gruntfuggly.renumber-selection"
vscode "gruntfuggly.todo-tree"
vscode "hilleer.yaml-plus-json"
vscode "jock.svg"
vscode "mattpocock.ts-error-translator"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mkxml.vscode-filesize"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-repositories"
vscode "naumovs.color-highlight"
vscode "nhoizey.gremlins"
vscode "oderwat.indent-rainbow"
vscode "phoenisx.cssvar"
vscode "pranaygp.vscode-css-peek"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "renatorodrigues.json-to-js"
vscode "ritwickdey.liveserver"
vscode "sleistner.vscode-fileutils"
vscode "solnurkarim.html-to-css-autocompletion"
vscode "tamasfe.even-better-toml"
vscode "tyriar.lorem-ipsum"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "yzhang.markdown-all-in-one"
vscode "zignd.html-css-class-completion"
