tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# tap "romkatv/powerlevel10k"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# A Zsh Theme
# brew "romkatv/powerlevel10k/powerlevel10k"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
# Web browser
cask "google-chrome"
# QuickLook generator for Markdown files
cask "qlmarkdown"
# QuickLook plugin for JSON files
cask "quicklook-json"
# Tool for telling interactive, nonlinear stories
cask "twine"
mas "1Password for Safari", id: 1569813296
mas "Connect my tablet", id: 1352696344
mas "Copy 'Em", id: 876540291
mas "Drafts", id: 1435957248
mas "Hand Mirror", id: 1502839586
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Messenger", id: 1480068668
mas "Speedtest", id: 1153157709
mas "TestFlight", id: 899247664
mas "TextSniper", id: 1528890965
