tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "oven-sh/bun"
tap "romkatv/powerlevel10k"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Development kit for the Java programming language
brew "openjdk"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
# Web browser
cask "google-chrome"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin for JSON files
cask "quicklook-json"
# Tool for telling interactive, nonlinear stories
cask "twine"
# Rust-based terminal
cask "warp"
mas "1Password for Safari", id: 1569813296
mas "Actions", id: 1586435171
mas "Color Picker", id: 1545870783
mas "Connect my tablet", id: 1352696344
mas "Copy 'Em", id: 876540291
mas "Drafts", id: 1435957248
mas "Hand Mirror", id: 1502839586
mas "Hyperduck", id: 6444667067
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Kindle Classic", id: 405399194
mas "Messenger", id: 1480068668
mas "Spaced", id: 1666327168
mas "Speedtest", id: 1153157709
mas "TestFlight", id: 899247664
mas "TextSniper", id: 1528890965

